# Import Libraries

In [2]:
import pandas as pd
import numpy as np

# Load Dataset

In [3]:
oews_data = pd.read_excel("./oes_research_2021_sec_55-56.xlsx")
cleaned_pums = pd.read_csv('./cleaned_pums_2021.csv')

# Inspecting the datasets

In [4]:
oews_data.head()

,AREA,AREA_TITLE,NAICS,NAICS_TITLE,I_GROUP,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,55,Management of Companies and Enterprises,sector,00-0000,All Occupations,total,21920,0,...,35.6,56.94,79.49,35470,47040,74050,118440,165330,NaN,NaN
1,1,Alabama,55,Management of Companies and Enterprises,sector,11-0000,Management Occupations,major,4820,4.1,...,61.13,92.03,#,61600,94020,127140,191420,#,NaN,NaN
2,1,Alabama,55,Management of Companies and Enterprises,sector,11-1021,General and Operations Managers,detailed,1600,7,...,60.5,#,#,60010,78520,125850,#,#,NaN,NaN
3,1,Alabama,55,Management of Companies and Enterprises,sector,11-2021,Marketing Managers,detailed,140,13.6,...,61.13,99.23,#,65240,98680,127140,206410,#,NaN,NaN
4,1,Alabama,55,Management of Companies and Enterprises,sector,11-2022,Sales Managers,detailed,140,14.7,...,49.56,77.94,#,59390,79010,103080,162110,#,NaN,NaN

In [5]:
cleaned_pums.head()

   WRK  SEX    SOCP
0    1    2  119151
1    2    1  119111
2    1    2  113121
3    1    1  1110XX
4    1    1  113051

# 1. Cleaning the Data Tidiness Issues

## 1.1 Making a copy of the `OEWS` data

In [6]:
cleaned_wage = oews_data.copy()

## 1.2 Cleaning teh tidiness issues

For the `OEWS` dataset, the following columns should be kept for California:

- `Area_Title`
- `OCC_CODE`
- `OCC_TITLE`
- `H_MEAN`

### Getting the data where the area is in California

In [8]:
cleaned_wage = cleaned_wage.loc[cleaned_wage['AREA_TITLE'] == 'California']

In [9]:
cleaned_wage.head()

,AREA,AREA_TITLE,NAICS,NAICS_TITLE,I_GROUP,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
377,6,California,55,Management of Companies and Enterprises,sector,00-0000,All Occupations,total,253120,0,...,39.94,62.56,92.38,38260,59640,83070,130120,192150,NaN,NaN
378,6,California,55,Management of Companies and Enterprises,sector,11-0000,Management Occupations,major,54180,2.3,...,77.52,99.57,#,95140,120800,161230,207110,#,NaN,NaN
379,6,California,55,Management of Companies and Enterprises,sector,11-1011,Chief Executives,detailed,2090,11.2,...,#,#,#,95610,163670,#,#,#,NaN,NaN
380,6,California,55,Management of Companies and Enterprises,sector,11-1021,General and Operations Managers,detailed,7090,5.8,...,80.69,#,#,83120,125110,167840,#,#,NaN,NaN
381,6,California,55,Management of Companies and Enterprises,sector,11-2011,Advertising and Promotions Managers,detailed,650,19,...,65.77,78.75,#,100340,120130,136790,163800,#,NaN,NaN

### Filtering the dataframe to keep only specific columns

In [10]:
cleaned_wage = cleaned_wage[['AREA_TITLE','OCC_CODE','OCC_TITLE','H_MEAN']]

In [11]:
cleaned_wage.head()

     AREA_TITLE OCC_CODE                            OCC_TITLE H_MEAN
377  California  00-0000                      All Occupations  50.16
378  California  11-0000               Management Occupations  82.61
379  California  11-1011                     Chief Executives  129.7
380  California  11-1021      General and Operations Managers  87.11
381  California  11-2011  Advertising and Promotions Managers  74.67

### Describing the data

In [12]:
cleaned_wage.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3223 entries, 377 to 70411
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   AREA_TITLE  3223 non-null   object
 1   OCC_CODE    3223 non-null   object
 2   OCC_TITLE   3223 non-null   object
 3   H_MEAN      3223 non-null   object
dtypes: object(4)
memory usage: 125.9+ KB

In [13]:
cleaned_wage.describe()

        AREA_TITLE OCC_CODE        OCC_TITLE   H_MEAN
count         3223     3223             3223  3223.00
unique           1      436              436  1715.00
top     California  00-0000  All Occupations    18.89
freq          3223       22               22    13.00

## 1.3 Performing visual inspection on the dataset

In [14]:
cleaned_wage.head()

     AREA_TITLE OCC_CODE                            OCC_TITLE H_MEAN
377  California  00-0000                      All Occupations  50.16
378  California  11-0000               Management Occupations  82.61
379  California  11-1011                     Chief Executives  129.7
380  California  11-1021      General and Operations Managers  87.11
381  California  11-2011  Advertising and Promotions Managers  74.67

The indexes are out of order. They can be placed back in order using the `reset_index()` function. Using the `drop=True` parameter, it ignored the order of the original index and drops it all together.

In [15]:
cleaned_wage = cleaned_wage.reset_index(drop=True)

In [16]:
cleaned_wage.head()

   AREA_TITLE OCC_CODE                            OCC_TITLE H_MEAN
0  California  00-0000                      All Occupations  50.16
1  California  11-0000               Management Occupations  82.61
2  California  11-1011                     Chief Executives  129.7
3  California  11-1021      General and Operations Managers  87.11
4  California  11-2011  Advertising and Promotions Managers  74.67

# 2. Cleaning the Data Quality Issues

## 2.1 Completeness

There are some missing data in the `OEWS` dataset, causing the `H_MEAN` column to be an object insted of a float. The '*' represents a wage estimate that is not avialable. '#' represents a wage equal or greater than 10 dollars per hour or greater tha 280,000 dollars per year.

These should be cleaned.

### 2.1.1 Inspecting the data types

In [18]:
cleaned_wage.dtypes

AREA_TITLE    object
OCC_CODE      object
OCC_TITLE     object
H_MEAN        object
dtype: object

### 2.1.2 Cleaning the missing values and ouliers

'*' and '#' values should be replaced with NaN then removed. Finally, the proccess should be confirmed successful through an assertion.

#### Replacing outliers and missing values with NaN

In [21]:
cleaned_wage['H_MEAN'].loc[cleaned_wage['H_MEAN'].isin(['*'])] = np.nan

C:\Users\MrIzzat\AppData\Local\Temp\ipykernel_28396\1617752069.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  cleaned_wage['H_MEAN'].loc[cleaned_wage['H_MEAN'].isin(['*'])] = np.nan

In [22]:
cleaned_wage['H_MEAN'].loc[cleaned_wage['H_MEAN'].isin(['#'])] = np.nan

C:\Users\MrIzzat\AppData\Local\Temp\ipykernel_28396\3522659392.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  cleaned_wage['H_MEAN'].loc[cleaned_wage['H_MEAN'].isin(['#'])] = np.nan

#### Confirming the conversion of these values

In [24]:
assert cleaned_wage['H_MEAN'].loc[cleaned_wage['H_MEAN'].isin(['#','*'])].sum() == 0

#### Dropping all NaN values

In [26]:
cleaned_wage = cleaned_wage.dropna()

#### Confirming no more missing data

In [30]:
assert cleaned_wage.isna().sum().sum() == 0

#### Converting the `H_MEAN` Column to float

In [33]:
cleaned_wage['H_MEAN'] = cleaned_wage['H_MEAN'].astype(float)

#### 2.1.3 Inspecting the cleaned data

In [34]:
assert cleaned_wage['AREA_TITLE'].dtype == 'object'
assert cleaned_wage['OCC_CODE'].dtype == 'object'
assert cleaned_wage['OCC_TITLE'].dtype == 'object'
assert cleaned_wage['H_MEAN'].dtype == 'float64'

## 2.2 Consistency

The `SOCP` column in the `PUMS` dataset is supposed to be the exact same as the `OCC_CODE` column in the `OEWS` column. Yet they have different names, due to an issue with hyphens. This should be fixed

### 2.2.1 Adding the `OCC_CODE` column to the `PUMS` dataset

It's just a copy of the `SOCP` column in the `PUMS` dataset

In [54]:
cleaned_pums['OCC_CODE'] = cleaned_pums['SOCP']

### 2.2.2 Cleaning the `OCC_CODE` in the `OEWS` dataset

The hypens in the `OCC_CODE` column should be removed

In [55]:
cleaned_wage['OCC_CODE'].head()

0    000000
1    110000
2    111011
3    111021
4    112011
Name: OCC_CODE, dtype: object

In [57]:
cleaned_wage['OCC_CODE'] = cleaned_wage['OCC_CODE'].str.replace('-','')

In [58]:
cleaned_wage['OCC_CODE'].head()

0    000000
1    110000
2    111011
3    111021
4    112011
Name: OCC_CODE, dtype: object

### 2.2.3 Combining the datasets

Now that the `OEWS` data is cleaned, it can be merged with the `PUMS` dataset.

The unnecessary `AREA_TITLE` column can be dropped as well as any NaN values. The `SOCP` column should be dropped as well. Finally, the index should be reset.

Duplicate values do not need to be removed because the only thing of value is if a certain number of individuals fall within the (OCC_TITLE/gender) group.

#### Merging the two datasets

In [59]:
merged_df = pd.merge(cleaned_pums,cleaned_wage,on=['OCC_CODE'],how='right')

In [60]:
merged_df.head()

,WRK,SEX,SOCP,OCC_CODE,AREA_TITLE,OCC_TITLE,H_MEAN
0,NaN,NaN,NaN,000000,California,All Occupations,50.16
1,NaN,NaN,NaN,110000,California,Management Occupations,82.61
2,NaN,NaN,NaN,111011,California,Chief Executives,129.70
3,1.0,1.0,111021,111021,California,General and Operations Managers,87.11
4,1.0,1.0,111021,111021,California,General and Operations Managers,87.11

#### Dropping NaN values

In [62]:
merged_df.dropna(inplace=True)

In [63]:
assert merged_df.isna().sum().sum() == 0

#### Dropping unnecessary columns `AREA_TITLE` and `SOCP`

In [64]:
merged_df.drop(['AREA_TITLE','SOCP'],axis=1)

        WRK  SEX OCC_CODE                        OCC_TITLE  H_MEAN
3       1.0  1.0   111021  General and Operations Managers   87.11
4       1.0  1.0   111021  General and Operations Managers   87.11
5       1.0  2.0   111021  General and Operations Managers   87.11
6       1.0  2.0   111021  General and Operations Managers   87.11
7       1.0  1.0   111021  General and Operations Managers   87.11
...     ...  ...      ...                              ...     ...
151449  2.0  1.0   119021            Construction Managers   53.49
151450  1.0  1.0   119021            Construction Managers   53.49
151451  1.0  1.0   119021            Construction Managers   53.49
151452  1.0  1.0   119021            Construction Managers   53.49
151453  1.0  1.0   119021            Construction Managers   53.49

[148516 rows x 5 columns]

#### Reseting the Index

In [67]:
merged_df = merged_df.reset_index(drop=True)

In [69]:
merged_df.head()

,WRK,SEX,SOCP,OCC_CODE,AREA_TITLE,OCC_TITLE,H_MEAN
0,1.0,1.0,111021,111021,California,General and Operations Managers,87.11
1,1.0,1.0,111021,111021,California,General and Operations Managers,87.11
2,1.0,2.0,111021,111021,California,General and Operations Managers,87.11
3,1.0,2.0,111021,111021,California,General and Operations Managers,87.11
4,1.0,1.0,111021,111021,California,General and Operations Managers,87.11

# 3. Storing the data

In [70]:
merged_df.to_csv('./clean_pum_oews.csv')

In [71]:
merged_df.to_pickle('./clean_pum_oews.pkl')